I managed to create a minimal example in the end, consider this main.tf:
```
terraform {}

provider "aws" {

  assume_role {
    role_arn = "arn:aws:iam::XXXXXXXXXXXXXX:role/terraform-admin"
  }
}

module "xyz" {
  source = "./module"

  providers = {
    aws = aws
  }

  depends_on = [
    aws_iam_role.instance_role
  ]
}


data "aws_iam_policy_document" "assume_role" {
  statement {
    actions = ["sts:AssumeRole"]

    principals {
      type        = "AWS"
      identifiers = ["arn:aws:iam::202656505727:root"]
    }

    condition {
      test     = "Bool"
      values   = [true]
      variable = "aws:MultiFactorAuthPresent"
    }
  }

  statement {
    actions = ["sts:AssumeRole"]

    principals {
      type        = "Service"
      identifiers = ["ec2.amazonaws.com"]
    }
  }
}

resource "aws_iam_role" "instance_role" {
  name               = "instance"
  assume_role_policy = data.aws_iam_policy_document.assume_role.json
  description        = "A role for r-cloud instance"
}

resource "aws_iam_instance_profile" "instance_profile" {
  name = "instance"
  role = aws_iam_role.instance_role.name
}
```

with ./module/main.tf looking like this:

```
provider "aws" {}

data "aws_vpc" "test" {
  tags = {
    Name = "default"
  }
}

resource "aws_security_group" "efs_access" {
  name   = "efs-access"
  vpc_id = data.aws_vpc.test.id
}
```

Now, when I remove:
```
  statement {
    actions = ["sts:AssumeRole"]

    principals {
      type        = "AWS"
      identifiers = ["arn:aws:iam::202656505727:root"]
    }

    condition {
      test     = "Bool"
      values   = [true]
      variable = "aws:MultiFactorAuthPresent"
    }
  }
```

I get this diff:

```
  # aws_iam_role.instance_role will be updated in-place
  ~ resource "aws_iam_role" "instance_role" {
        arn                   = "arn:aws:iam::081352067163:role/instance"
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Condition = {
                          - Bool = {
                              - aws:MultiFactorAuthPresent = "true"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::202656505727:root"
                        }
                      - Sid       = ""
                    },
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "ec2.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        create_date           = "2021-04-15T09:36:47Z"
        description           = "A role for r-cloud instance"
        force_detach_policies = false
        id                    = "instance"
        managed_policy_arns   = []
        max_session_duration  = 3600
        name                  = "instance"
        path                  = "/"
        tags                  = {}
        unique_id             = "AROARF4HWBBNZMHKLRBIH"

        inline_policy {}
    }

  # module.xyz.data.aws_vpc.test will be read during apply
  # (config refers to values not yet known)
 <= data "aws_vpc" "test"  {
      ~ arn                     = "arn:aws:ec2:ap-southeast-2:081352067163:vpc/vpc-0392b59df9aab82db" -> (known after apply)
      ~ cidr_block              = "172.50.0.0/16" -> (known after apply)
      ~ cidr_block_associations = [
          - {
              - association_id = "vpc-cidr-assoc-0b50d9f69716ca74a"
              - cidr_block     = "172.50.0.0/16"
              - state          = "associated"
            },
        ] -> (known after apply)
      ~ default                 = false -> (known after apply)
      ~ dhcp_options_id         = "dopt-11366a76" -> (known after apply)
      ~ enable_dns_hostnames    = true -> (known after apply)
      ~ enable_dns_support      = true -> (known after apply)
      ~ id                      = "vpc-0392b59df9aab82db" -> (known after apply)
      ~ instance_tenancy        = "default" -> (known after apply)
      ~ ipv6_association_id     = "vpc-cidr-assoc-0272c3454d0bb2122" -> (known after apply)
      ~ ipv6_cidr_block         = "2406:da1c:d11:7d00::/56" -> (known after apply)
      ~ main_route_table_id     = "rtb-0fef3d09dfacaa697" -> (known after apply)
      ~ owner_id                = "081352067163" -> (known after apply)
      ~ state                   = "available" -> (known after apply)
      ~ tags                    = {
            "Name"        = "default"
          - "environment" = "sandpit" -> null
        }
    }

  # module.xyz.aws_security_group.efs_access must be replaced
-/+ resource "aws_security_group" "efs_access" {
      ~ arn                    = "arn:aws:ec2:ap-southeast-2:081352067163:security-group/sg-0a76b35b37514b406" -> (known after apply)
        description            = "Managed by Terraform"
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-0a76b35b37514b406" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
        name                   = "efs-access"
      + name_prefix            = (known after apply)
      ~ owner_id               = "081352067163" -> (known after apply)
        revoke_rules_on_delete = false
      - tags                   = {} -> null
      ~ vpc_id                 = "vpc-0392b59df9aab82db" -> (known after apply) # forces replacement
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

I wished `# module.xyz.data.aws_vpc.test will be read during apply` wouldn't be in there, but that `# module.xyz.aws_security_group.efs_access must be replaced` is in there is clearly a bug?

The debug output looks like this: https://gist.github.com/sblask/ac921d4ee4fdc7e7dd21e382c16ce2cc
